#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
#+Title: Seminar Data Science for Economics
#+Author: Jan Boone and Madina Kurmangaliyeva
#+OPTIONS: toc:2 timestamp:nil toc:nil

This website contains the material for the MSc course Seminar Data Science for Economics

**This website is under construction for 2020/2021**

This year the course is taught by:
+ Jan Boone
+ Madina Kurmangaliyeva
+ Jing-Rong Zeng

** From Datacamp, do the following courses for the first part of the course

+ [[https://www.datacamp.com/courses/statistical-simulation-in-python][statistical simulation]]
+ [[https://www.datacamp.com/courses/deep-learning-with-keras-in-python][keras]]
+ [[https://www.datacamp.com/courses/introduction-to-tensorflow-in-python][tensorflow]]

A couple of notes on these datacamp courses:

The [[https://www.datacamp.com/courses/statistical-simulation-in-python][statistical simulation]] course starts with very simple statistical concepts. But rapidly things become more challenging. The focus of our seminar will not be on statistical simulation per se, but we will use it to understand the properties of estimators. Hence, it is important to understand the "flow" of having a statistical process and then repeating it 10,000 times to understand its properties. You also learn how to use numpy's statistical functions from ~numpy.random~.

The point for us of this Datacamp course is to become comfortable with modelling data generating processes. Not the specific applications considered in this course.

You may not have seen the ~get~ method of a dictionary. Here you see it in action in a simple example (borrowed from [[https://stackoverflow.com/questions/2068349/understanding-get-method-in-python][stackoverflow]]):

#+BEGIN_SRC ipython
sentence="The quick brown fox jumped over the lazy dog."
characters={}

for character in sentence:
    characters[character] = characters.get(character, 0) + 1

print(characters)
#+END_SRC

#+RESULTS:
: {'T': 1, 'h': 2, 'e': 4, ' ': 8, 'q': 1, 'u': 2, 'i': 1, 'c': 1, 'k': 1, 'b': 1, 'r': 2, 'o': 4, 'w': 1, 'n': 1, 'f': 1, 'x': 1, 'j': 1, 'm': 1, 'p': 1, 'd': 2, 'v': 1, 't': 1, 'l': 1, 'a': 1, 'z': 1, 'y': 1, 'g': 1, '.': 1}

~characters~ is a dictionary with ~key~ a character (including "space") from the ~sentence~ and the ~value~ equals the number of times the character has occured up till then. If a character "happens" for the first time, ~get~ cannot find it in the dictionary ~characters~ and returns the default value (here specified as 0). If character has happened, say, 3 times before, ~get~ returns the value 3 and we add 1, so the new value equals 4.

If you run into other functions that you are not familiar with, you can use "?", like in:

#+BEGIN_SRC jupyter-python :session py :kernel python3
np.random.binomial?
#+END_SRC

Also, you can google!

Things to take away from this course:
+ how to use random variables in python
+ how to create samples out of a population (e.g. by using ~np.random.choice~)
+ how to model statistical processes (data generating processes)
+ how to use resampling methods like bootstrapping
+ how to use permutation testing
+ how to use simulation for power analysis

This [[https://www.datacamp.com/courses/deep-learning-with-keras-in-python][keras]] course is "hands on" and has a lot of applications. If you prefer a course with some more background on the math of neural networks, you can do [[https://www.datacamp.com/courses/deep-learning-in-python][this one]] instead.

Note that for this [[https://www.datacamp.com/courses/deep-learning-with-keras-in-python][keras]] course Chapter 4 is fun but optional.

The [[https://www.datacamp.com/courses/introduction-to-tensorflow-in-python][tensorflow]] course gives some more background on the syntax used in tensorflow that we also use in class. All the keras commands you learn in the keras course are easily applied under tensorflow.

